[
  "Are you French? Because Eiffel for you.",
  "Do you have a map? I keep getting lost in your eyes.",
  "If you were a vegetable, you’d be a cute-cumber.",
  "Is your name Google? Because you have everything I’ve been searching for.",
  "Do you have a Band-Aid? I just scraped my knee falling for you.",
  "Are you made of copper and tellurium? Because you’re Cu-Te.",
  "Are you a magician? Because every time I look at you, everyone else disappears.",
  "Are you a parking ticket? Because you’ve got FINE written all over you.",
  "Are you Wi-Fi? Because I’m feeling a connection.",
  "Is your name Chapstick? Because you’re da balm.",
  "Do you have a pencil? Because I want to erase your past and write our future.",
  "Is your name Waldo? Because someone like you is hard to find.",
  "Are you a loan from a bank? Because you have my interest.",
  "Are you a campfire? Because you’re hot and I want s'more.",
  "Do you believe in love at first sight, or should I walk by again?",
  "Is your name Starbucks? Because I like you a latte.",
  "Are you Australian? Because when I look at you, I feel like I’m down under.",
  "Do you like raisins? How about a date?",
  "Are you a time traveler? Because I can see you in my future.",
  "Is your name chocolate? Because you’re sweet and I crave you.",
  "If you were a fruit, you’d be a fineapple.",
  "Are you an alien? Because you’ve just abducted my heart.",
  "Is your dad a boxer? Because you’re a knockout.",
  "Are you a keyboard? Because you’re my type.",
  "Is there a sparkle in your eye, or are you always this magical?",
  "Are you a volcano? Because I lava you.",
  "Do you like Harry Potter? Because I a-Dumbledore you.",
  "Are you the ocean? Because I’m lost at sea in your eyes.",
  "Are you a phone charger? Because without you, I’d die.",
  "Are you a snowstorm? Because you’ve just made my heart freeze.",
  "If you were a song, you’d be the best track on the album.",
  "Are you Cinderella? Because I see that dress, and I’m speechless.",
  "Are you the sun? Because you brighten up my day.",
  "Are you a firework? Because you light up my life.",
  "If beauty were a crime, you’d be serving a life sentence.",
  "If I could rearrange the alphabet, I’d put U and I together.",
  "Are you a star? Because your beauty lights up the night.",
  "Is your name Wi-Fi? Because I’m feeling that connection.",
  "Is your name Google? Because you’ve got what I’m searching for.",
  "Do you believe in fate? Because I think we’ve just met for a reason.",
  "Are you a compass? Because you’ve just given me direction in life.",
  "Are you a baker? Because you’re sweet as pie.",
  "Are you a camera? Because every time I look at you, I smile.",
  "Are you an artist? Because you just painted a smile on my face.",
  "If you were a movie, you’d be rated 10/10.",
  "Do you have a sunburn, or are you always this hot?",
  "Are you a cat? Because you’ve got purr-sonality.",
  "Are you a lightbulb? Because you brighten up my world.",
  "Are you a clock? Because I’ve been counting the seconds until I see you again.",
  "Are you a sandwich? Because you’re making me hungry for more.",
  "Are you a cloud? Because I’m on cloud nine when I’m with you.",
  "Are you a dictionary? Because you’re adding meaning to my life.",
  "Do you have a name, or can I call you mine?",
  "Are you made of stars? Because your beauty lights up the night.",
  "Are you a ticket? Because I’m checked in for this ride.",
  "Are you a flashlight? Because you’ve just lit up my world.",
  "Do you have a twin? Because I can’t believe there’s only one of you.",
  "Are you a diamond? Because you shine like one.",
  "Is your heart a compass? Because it’s pointing me toward you.",
  "Are you a superhero? Because you’ve saved my day.",
  "Are you the moon? Because you control the tide of my heart.",
  "Is your name Lucky? Because I feel lucky to have found you.",
  "Do you like science? Because I’ve got chemistry with you.",
  "Are you a plant? Because I can’t stop growing my feelings for you.",
  "Are you the rain? Because you’re making my heart race.",
  "Are you a sunrise? Because you’ve just brightened my morning.",
  "Is your name Summer? Because you’re hot!",
  "Are you the moon? Because I orbit around you.",
  "Are you a genie? Because you just made all my wishes come true.",
  "Are you the North Star? Because I’ve been lost until I found you.",
  "Are you a compass? Because every direction leads me to you.",
  "Are you a battery? Because you’re powering up my day.",
  "Are you a diamond? Because I’ve been mining for someone like you.",
  "Are you the key to my heart? Because you just unlocked it.",
  "Are you a sunset? Because you’ve painted my world with beauty.",
  "Are you a seashell? Because you bring the sound of love to my heart.",
  "Are you a pilot? Because you’ve taken me to new heights.",
  "Are you a cup of coffee? Because you’ve made my morning complete.",
  "Are you the stars? Because you light up my night.",
  "Are you a rainbow? Because you’ve added color to my life.",
  "Are you lightning? Because you’ve just electrified my heart.",
  "Is your name Cupid? Because you’ve just shot me with an arrow.",
  "Are you a locksmith? Because you’ve just unlocked my heart.",
  "Are you a meteor? Because you’ve just crashed into my world.",
  "Are you an architect? Because you’ve just built a place in my heart.",
  "Are you a candle? Because you’ve lit up my life.",
  "Are you a runway? Because my heart is taking off.",
  "Are you a volcano? Because you’ve just erupted my heart with love.",
  "Are you a compass? Because you’ve just pointed me in the right direction.",
  "Are you a memory? Because I can’t forget you.",
  "Are you a key? Because you’ve unlocked my love.",
  "Are you a plane? Because you’ve just taken my heart for a ride.",
  "Are you a watch? Because I’ve lost track of time with you.",
  "Are you an anchor? Because you’ve grounded my heart.",
  "Are you a flower? Because you’ve bloomed love in my heart."
]
